ArduCAM/Energia/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/aes256.xml
<module id="AES256" HW_revision=""><register id="CTL0" width="16" offset="0x0" internal="0" description="AES Accelerator Control Register 0"><bitfield id="OPx" description="AES operation" begin="1" end="0" width="2" rwaccess="R/W"><bitenum id="OP__0" value="0" description="Encryption"/><bitenum id="OP__1" value="1" description="Decryption. The provided key is the same key used for encryption"/><bitenum id="OP__2" value="2" description="Generate first round key required for decryption"/><bitenum id="OP__3" value="3" description="Decryption"/></bitfield><bitfield id="KLx" description="AES key length" begin="3" end="2" width="2" rwaccess="R/W"><bitenum id="KL__0" value="0" description="AES128. The key size is 128 bit"/><bitenum id="KL__1" value="1" description="AES192. The key size is 192 bit."/><bitenum id="KL__2" value="2" description="AES256. The key size is 256 bit"/></bitfield><bitfield id="CMx" description="AES cipher mode select" begin="6" end="5" width="2" rwaccess="R/W"><bitenum id="CM__0" value="0" description="ECB"/><bitenum id="CM__1" value="1" description="CBC"/><bitenum id="CM__2" value="2" description="OFB"/><bitenum id="CM__3" value="3" description="CFB"/></bitfield><bitfield id="SWRST" description="AES software reset" begin="7" end="7" width="1" rwaccess="R/W"><bitenum id="SWRST__0" value="0" description="No reset"/><bitenum id="SWRST__1" value="1" description="Reset AES accelerator module"/></bitfield><bitfield id="RDYIFG" description="AES ready interrupt flag" begin="8" end="8" width="1" rwaccess="R/W"><bitenum id="RDYIFG__0" value="0" description="No interrupt pending"/><bitenum id="RDYIFG__1" value="1" description="Interrupt pending"/></bitfield><bitfield id="ERRFG" description="AES error flag" begin="11" end="11" width="1" rwaccess="R/W"><bitenum id="ERRFG__0" value="0" description="No error"/><bitenum id="ERRFG__1" value="1" description="Error occurred"/></bitfield><bitfield id="RDYIE" description="AES ready interrupt enable" begin="12" end="12" width="1" rwaccess="R/W"><bitenum id="RDYIE__0" value="0" description="Interrupt disabled"/><bitenum id="RDYIE__1" value="1" description="Interrupt enabled"/></bitfield><bitfield id="CMEN" description="AESCMEN enables the support of the ciphermodes ECB, CBC, OFB an" begin="15" end="15" width="1" rwaccess="R/W"><bitenum id="CMEN__0" value="0" description="No DMA triggers are generated"/><bitenum id="CMEN__1" value="1" description="DMA ciphermode support operation is enabled and the correspondi"/></bitfield></register><register id="CTL1" width="16" offset="0x2" internal="0" description="AES Accelerator Control Register 1"><bitfield id="BLKCNTx" description="Cipher Block Counter" begin="7" end="0" width="8" rwaccess="R/W"/></register><register id="STAT" width="16" offset="0x4" internal="0" description="AES Accelerator Status Register"><bitfield id="BUSY" description="AES accelerator module busy; encryption, decryption, or key gen" begin="0" end="0" width="1" rwaccess="R/W"><bitenum id="BUSY__0" value="0" description="Not busy"/><bitenum id="BUSY__1" value="1" description="Busy"/></bitfield><bitfield id="KEYWR" description="All 16 bytes written to AESAKEY" begin="1" end="1" width="1" rwaccess="R/W"><bitenum id="KEYWR__0" value="0" description="Not all bytes written"/><bitenum id="KEYWR__1" value="1" description="All bytes written"/></bitfield><bitfield id="DINWR" description="All 16 bytes written to AESADIN, AESAXDIN or AESAXIN" begin="2" end="2" width="1" rwaccess="R/W"><bitenum id="DINWR__0" value="0" description="Not all bytes written"/><bitenum id="DINWR__1" value="1" description="All bytes written"/></bitfield><bitfield id="DOUTRD" description="All 16 bytes read from AESADOUT" begin="3" end="3" width="1" rwaccess="R/W"><bitenum id="DOUTRD__0" value="0" description="Not all bytes read"/><bitenum id="DOUTRD__1" value="1" description="All bytes read"/></bitfield><bitfield id="KEYCNTx" description="Bytes written via AESAKEY for AESKLx=00, half-words written via" begin="7" end="4" width="4" rwaccess="R/W"/><bitfield id="DINCNTx" description="Bytes written via AESADIN, AESAXDIN or AESAXIN" begin="11" end="8" width="4" rwaccess="R/W"/><bitfield id="DOUTCNTx" description="Bytes read via AESADOUT" begin="15" end="12" width="4" rwaccess="R/W"/></register><register id="KEY" width="16" offset="0x6" internal="0" description="AES Accelerator Key Register"><bitfield id="KEY0x" description="AES key byte n when AESAKEY is written as half-word" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="KEY1x" description="AES key byte n+1 when AESAKEY is written as half-word" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="DIN" width="16" offset="0x8" internal="0" description="AES Accelerator Data In Register"><bitfield id="DIN0x" description="AES data in byte n when AESADIN is written as half-word" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="DIN1x" description="AES data in byte n+1 when AESADIN is written as half-word" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="DOUT" width="16" offset="0xA" internal="0" description="AES Accelerator Data Out Register"><bitfield id="DOUT0x" description="AES data out byte n when AESADOUT is read as half-word" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="DOUT1x" description="AES data out byte n+1 when AESADOUT is read as half-word" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="XDIN" width="16" offset="0xC" internal="0" description="AES Accelerator XORed Data In Register"><bitfield id="XDIN0x" description="AES data in byte n when AESAXDIN is written as half-word" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="XDIN1x" description="AES data in byte n+1 when AESAXDIN is written as half-word" begin="15" end="8" width="8" rwaccess="R/W"/></register><register id="XIN" width="16" offset="0xE" internal="0" description="AES Accelerator XORed Data In Register"><bitfield id="XIN0x" description="AES data in byte n when AESAXIN is written as half-word" begin="7" end="0" width="8" rwaccess="R/W"/><bitfield id="XIN1x" description="AES data in byte n+1 when AESAXIN is written as half-word" begin="15" end="8" width="8" rwaccess="R/W"/></register></module>